(display "Клим Липовський ІПЗ-41. Лаб 1. Варіант 9. Частина 1.\n")

; змінна для визначення глибини рекурсії
(define depth 0)

; рекурсивна функція для виконання задачі
(define (f n)
  ; збільшення depth на кожному витку рекурсії
  (set! depth (+ depth 1))
  ; cond для задання декількох умов
  (cond ((= n 1) 1)  ; Перевірка чи n = 1
        ((EVEN? n) (* 2 (f(/ n 2))))  ; Перевірка чи n парне
        ((ODD? n)(* 2 (f(/ (- n 1) 2)))) ; Перевірка чи n непарне
        )
  )

(display "Номер людини що залишиться серед 20 людей: ") (f 6235)
(display "Глибина рекурсії: ") depth