(display "Клим Липовський ІПЗ-41. Лаб 2. Варіант 9. Частина 2.\n")

; функція обчислення натурального числа
(define (f i n)
  ; зупинка рекурсії при i > n
  (if (> i n)
      (sqrt (* 3 (- i 1)))
      ; розвинення кореня числа у рекурсивний вираз
      (sqrt (+ (* 3 (- i 1)) (f (+ i 1) n))) 
      )
  )

(display "Відповідь при n-1: ")(display (f 2 1)) ; початкове i = 2, щоб при i-1 не було 0
(display "\nВідповідь при n-2: ")(display (f 2 2))
(display "\nВідповідь при n-3: ")(display (f 2 3))
(display "\nВідповідь при n-4: ")(display (f 2 4))
(display "\nВідповідь при n-5: ")(display (f 2 5))
