; Визначення функції інфікс
(define (infix x)
  ; Якщо x є парою (тобто списком)
  (if (pair? x)
      ; Якщо список містить принаймні 3 елементи (бінарна операція)
      (if (pair? (cddr x))
          ; Рекурсивний виклик infix для 2-го та 3-го елементів і повернення нового списку з 1-м елементом як оператор
          (list (infix (cadr x)) (car x) (infix (caddr x)))
          ; В іншому випадку x є унарною операцією, тому повернення нового списку із 1-м елементом як оператором і 2-м елементом як операндом
          (list (car x) (infix (cadr x))))
      ; Якщо x не є парою, поверніть x як є
      x))

; Приклад використання:
(infix '(+ a (* b c)))
; Має повернути => (a + (b * c))
